In [1]:
import numpy as np

In [2]:
import pandas as pd

### PANDAS - SERIES

In [4]:
myindex = ['USA', 'Canada', 'Mexico']

In [5]:
mydata = [1776, 1867, 1821]

In [14]:
myseries = pd.Series(data = mydata, index = myindex) # Can also be written as: pd.Series(mydata, myindex)

In [15]:
myseries

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [16]:
myseries[0]

1776

In [17]:
myseries['USA']

1776

In [18]:
ages = {'Alhan': 5, 'Ali': 7, 'Sameer': 9}

In [19]:
pd.Series(ages)

Alhan     5
Ali       7
Sameer    9
dtype: int64

In [1]:
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100, 'China': 500, 'India': 210, 'USA': 260}

In [4]:
sales_q1 = pd.Series(q1)

In [5]:
sales_q2 = pd.Series(q2)

In [6]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [7]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [8]:
sales_q1['Japan']

80

In [9]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [10]:
sales_q1 * 2

Japan    160
China    900
India    400
USA      500
dtype: int64

In [11]:
sales_q1 / 100

Japan    0.8
China    4.5
India    2.0
USA      2.5
dtype: float64

In [12]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [13]:
sales_q1.add(sales_q2, fill_value = 0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

### PANDAS - DATAFRAMES

In [18]:
np.random.seed(101)
mydata = np.random.randint(0, 101, (4, 3))

In [19]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [20]:
myindex = ['CA', 'NY', 'AZ', 'TX']

In [21]:
mycolumns = ['Jan', 'Feb', 'Mar']

In [29]:
df = pd.DataFrame(mydata, index = myindex, columns = mycolumns) # => pd.DataFrame(mydata, myindex, mycolumns)

In [30]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

Shows the current path of the Notebook

In [33]:
pwd

'C:\\Users\\gc\\Jupyter\\Practice Notes'

Lists all the files located in the current directory

In [39]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 86CB-7C82

 Directory of C:\Users\gc\Jupyter\Practice Notes

06/24/2023  11:06 AM    <DIR>          .
06/24/2023  11:06 AM    <DIR>          ..
06/22/2023  10:27 PM    <DIR>          .ipynb_checkpoints
06/24/2023  10:52 AM            29,293 1. Numpy.ipynb
06/24/2023  11:06 AM            13,045 2. Pandas.ipynb
               2 File(s)         42,338 bytes
               3 Dir(s)  22,077,579,264 bytes free

In [42]:
df = pd.read_csv('D:/Datasets/titanic_data.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [44]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [49]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [52]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [53]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

### Columns

In [54]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [56]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [58]:
df[['Name', 'Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [60]:
100 * df['Age'] + df['Fare']

0      2207.2500
1      3871.2833
2      2607.9250
3      3553.1000
4      3508.0500
         ...
886    2713.0000
887    1930.0000
888          NaN
889    2630.0000
890    3207.7500
Length: 891, dtype: float64

In [66]:
df['new_column'] = np.round(100 * df['Age'] + df['Fare']) # => np.round = RoundOff

In [67]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_column
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2207.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3871.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2608.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3553.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,3508.0

In [69]:
df = df.drop('new_column', axis = 1) # => Default axis value is 0 which is Row/Index

In [71]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [73]:
df = df.set_index('PassengerId')

In [74]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [76]:
df = df.reset_index()

In [77]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Integer Location

In [78]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

Label Based Location / String Index Can Be Passed

In [82]:
df.loc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

 Selecting Multiple Rows / Indexes With Integer Location

In [83]:
df.iloc[0:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

Selecting Multiple Rows With Label Based Location

In [85]:
df.loc[[1, 5, 9, 81]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
81,82,1,3,"Sheerlinck, Mr. Jan Baptist",male,29.0,0,0,345779,9.5000,NaN,S

In [87]:
df.drop(67, axis = 0) #Dropping Rows/Indexes

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Conditional Filtering

In [99]:
myindex = ['USA', 'CANADA', 'MEXICO']
mydata = [[1716, 328, 20.5], [1867, 38, 1.7], [1821, 126, 1.22]]
mycolumns =['Year', 'Pop', 'GDP']

mydf = pd.DataFrame(mydata, myindex, mycolumns)

In [100]:
mydf

        Year  Pop    GDP
USA     1716  328  20.50
CANADA  1867   38   1.70
MEXICO  1821  126   1.22

In [105]:
mydf['Pop'] > 100

USA        True
CANADA    False
MEXICO     True
Name: Pop, dtype: bool

In [106]:
bool_series = mydf['Pop'] > 100

In [107]:
mydf[bool_series]

        Year  Pop    GDP
USA     1716  328  20.50
MEXICO  1821  126   1.22

In [108]:
mydf[mydf['Pop'] > 100]

        Year  Pop    GDP
USA     1716  328  20.50
MEXICO  1821  126   1.22

In [109]:
mydf[mydf['GDP'] < 10]

        Year  Pop   GDP
CANADA  1867   38  1.70
MEXICO  1821  126  1.22

### MULTIPLE CONDITIONS

Python's inbuilt 'and' and 'or' logical operators don't work here because they are meant to compare two boolean values
and here we are comparing SERIES thats why we have to us '&' for AND, '|' for OR.

In [111]:
mydf

        Year  Pop    GDP
USA     1716  328  20.50
CANADA  1867   38   1.70
MEXICO  1821  126   1.22

In [114]:
mydf[(mydf['Pop'] > 200) & (mydf['GDP'] > 10)] # => () ARE COMPULSORY

     Year  Pop   GDP
USA  1716  328  20.5

In [115]:
mydf[(mydf['Pop'] > 200) | (mydf['Year'] == 1716)]

     Year  Pop   GDP
USA  1716  328  20.5

In [116]:
options = [1867, 1821]

In [117]:
mydf['Year'].isin(options)

USA       False
CANADA     True
MEXICO     True
Name: Year, dtype: bool

In [118]:
mydf[mydf['Year'].isin(options)]

        Year  Pop   GDP
CANADA  1867   38  1.70
MEXICO  1821  126  1.22

In [120]:
mydf[mydf['Year'].isin([1867, 1821])]

        Year  Pop   GDP
CANADA  1867   38  1.70
MEXICO  1821  126  1.22

### Useful Methods

In [128]:
mydf

        Year  Pop    GDP
USA     1716  328  20.50
CANADA  1867   38   1.70
MEXICO  1821  126   1.22

In [125]:
def last_two(num):
    return int(str(num)[-2:])

In [132]:
mydf['Year'].apply(last_two)

USA       16
CANADA    67
MEXICO    21
Name: Year, dtype: int64

In [133]:
mydf['Pop'].mean()

164.0

#### Using Methods With Multiple Columns

In [4]:
myindex = ['USA', 'CANADA', 'MEXICO']
mydata = [[1716, 328, 20.5], [1867, 38, 1.7], [1821, 126, 1.22]]
mycolumns =['Year', 'Pop', 'GDP']

mydf = pd.DataFrame(mydata, myindex, mycolumns)

In [6]:
mydf

        Year  Pop    GDP
USA     1716  328  20.50
CANADA  1867   38   1.70
MEXICO  1821  126   1.22

In [11]:
mydf['GDP'].apply(lambda num: num * 2) # Example of Lambda Expression

USA       41.00
CANADA     3.40
MEXICO     2.44
Name: GDP, dtype: float64

In [12]:
def quality_check(pop, gdp):
    if pop + gdp > 50:
        return "Passed"
    else:
        return "Failed"

In [19]:
mydf['Check'] = mydf[['Pop', 'GDP']].apply(lambda mydf: quality_check(mydf['Pop'], mydf['GDP']), axis = 1)

In [20]:
mydf

        Year  Pop    GDP   Check
USA     1716  328  20.50  Passed
CANADA  1867   38   1.70  Failed
MEXICO  1821  126   1.22  Passed

### OR

In [23]:
mydf['Check'] = np.vectorize(quality_check)(mydf['Pop'], mydf['GDP']) # => Faster

In [24]:
mydf

        Year  Pop    GDP   Check
USA     1716  328  20.50  Passed
CANADA  1867   38   1.70  Failed
MEXICO  1821  126   1.22  Passed

### Statistical Information & Sorting

In [25]:
index = ['Alhan', 'Ahsan', 'Aliaan', 'Ahmed', 'Qasim']
data = np.random.randint(0, 101, (5, 5))
columns = ['Maths', 'Physics', 'English', 'Urdu', 'Computer']

df = pd.DataFrame(data, index, columns)

In [26]:
df

        Maths  Physics  English  Urdu  Computer
Alhan      69        1       76    23        16
Ahsan       9       33       39    72        68
Aliaan     87       86       76    21        55
Ahmed       4       79       25    82        13
Qasim      43       53       50    84        75

In [27]:
df.describe()

           Maths    Physics    English      Urdu  Computer
count   5.000000   5.000000   5.000000   5.00000   5.00000
mean   42.400000  50.400000  53.200000  56.40000  45.40000
std    36.356567  34.767801  22.620787  31.73799  29.12559
min     4.000000   1.000000  25.000000  21.00000  13.00000
25%     9.000000  33.000000  39.000000  23.00000  16.00000
50%    43.000000  53.000000  50.000000  72.00000  55.00000
75%    69.000000  79.000000  76.000000  82.00000  68.00000
max    87.000000  86.000000  76.000000  84.00000  75.00000

In [28]:
df.describe().transpose()

          count  mean        std   min   25%   50%   75%   max
Maths       5.0  42.4  36.356567   4.0   9.0  43.0  69.0  87.0
Physics     5.0  50.4  34.767801   1.0  33.0  53.0  79.0  86.0
English     5.0  53.2  22.620787  25.0  39.0  50.0  76.0  76.0
Urdu        5.0  56.4  31.737990  21.0  23.0  72.0  82.0  84.0
Computer    5.0  45.4  29.125590  13.0  16.0  55.0  68.0  75.0

In [31]:
df.sort_values('Urdu', ascending = False)

        Maths  Physics  English  Urdu  Computer
Qasim      43       53       50    84        75
Ahmed       4       79       25    82        13
Ahsan       9       33       39    72        68
Alhan      69        1       76    23        16
Aliaan     87       86       76    21        55

In [32]:
df.sort_values(['Urdu', 'English'])

        Maths  Physics  English  Urdu  Computer
Aliaan     87       86       76    21        55
Alhan      69        1       76    23        16
Ahsan       9       33       39    72        68
Ahmed       4       79       25    82        13
Qasim      43       53       50    84        75

In [33]:
df['Computer'].max()

75

In [35]:
df['Computer'].idxmax() #=> Index Location of Max Value

'Qasim'

In [39]:
df['Computer'].argmax() #=> Index Loaction of Max Value in Numbers

4

In [42]:
df.loc['Qasim']

Maths       43
Physics     53
English     50
Urdu        84
Computer    75
Name: Qasim, dtype: int32

In [44]:
df.corr() #=> Return Corelation Between The Columns

             Maths   Physics   English      Urdu  Computer
Maths     1.000000 -0.047823  0.966241 -0.856845  0.036169
Physics  -0.047823  1.000000 -0.280492  0.208934  0.136081
English   0.966241 -0.280492  1.000000 -0.905510  0.017682
Urdu     -0.856845  0.208934 -0.905510  1.000000  0.265635
Computer  0.036169  0.136081  0.017682  0.265635  1.000000

In [46]:
df['Maths'].value_counts() #=> Used to count Catagorical Data

69    1
9     1
87    1
4     1
43    1
Name: Maths, dtype: int64

In [48]:
df['Physics'].unique() #=> Unique Values

array([ 1, 33, 86, 79, 53])

In [49]:
df['Physics'].nunique() #=> Number of Unique Values

5

In [53]:
df['Physics'].replace(1, 101)

Alhan     101
Ahsan      33
Aliaan     86
Ahmed      79
Qasim      53
Name: Physics, dtype: int32

In [54]:
df['Physics'].replace([1, 33], [101, 102])

Alhan     101
Ahsan     102
Aliaan     86
Ahmed      79
Qasim      53
Name: Physics, dtype: int32

In [57]:
mymap = {1: 101, 33: 102}
df['Physics'].map(mymap)

Alhan     101.0
Ahsan     102.0
Aliaan      NaN
Ahmed       NaN
Qasim       NaN
Name: Physics, dtype: float64

In [60]:
df.duplicated() #=> To Drop Duplicates => df.drop_duplicates()

Alhan     False
Ahsan     False
Aliaan    False
Ahmed     False
Qasim     False
dtype: bool

In [61]:
df

        Maths  Physics  English  Urdu  Computer
Alhan      69        1       76    23        16
Ahsan       9       33       39    72        68
Aliaan     87       86       76    21        55
Ahmed       4       79       25    82        13
Qasim      43       53       50    84        75

In [66]:
df[df['Physics'].between(50, 100)]

        Maths  Physics  English  Urdu  Computer
Aliaan     87       86       76    21        55
Ahmed       4       79       25    82        13
Qasim      43       53       50    84        75

In [67]:
df.nlargest(2, 'Computer')

       Maths  Physics  English  Urdu  Computer
Qasim     43       53       50    84        75
Ahsan      9       33       39    72        68

In [68]:
df.nsmallest(2, 'English')

       Maths  Physics  English  Urdu  Computer
Ahmed      4       79       25    82        13
Ahsan      9       33       39    72        68

In [73]:
df.sample(1) #=> Returns Random Rows

       Maths  Physics  English  Urdu  Computer
Ahsan      9       33       39    72        68

### COMBINING DATAFRAMES

In [3]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [4]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [5]:
one = pd.DataFrame(data_one)

In [6]:
two = pd.DataFrame(data_two)

In [9]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [8]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [10]:
pd.concat([one, two], axis = 1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
pd.concat([one, two], axis = 0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [17]:
two.columns = one.columns

In [18]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [20]:
mydf = pd.concat([one, two], axis = 0)

In [21]:
mydf.index = range(len(mydf))

In [22]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [23]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [24]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [25]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [26]:
pd.merge(registrations, logins, how = 'inner', on = 'name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [29]:
pd.merge(left = registrations, right = logins, how = 'left', on = 'name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [30]:
pd.merge(registrations, logins, how = 'outer', on = 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [31]:
registrations = registrations.set_index('name')

In [33]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [34]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

### STRING DATA

In [3]:
email = 'ahsannaddiir@gmail.com'

In [4]:
email.upper()

'AHSANNADDIIR@GMAIL.COM'

In [5]:
email.split("@")

['ahsannaddiir', 'gmail.com']

In [6]:
names = pd.Series(['andrew', 'bob', 'claire', 'david', '5'])

In [7]:
names.str.upper()

0    ANDREW
1       BOB
2    CLAIRE
3     DAVID
4         5
dtype: object

In [8]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [11]:
tech_finance = ['GOOG, APPL, AMZN', 'JPM, BAC, GS']

In [12]:
tickers = pd.Series(tech_finance)

In [14]:
tickers

0    GOOG, APPL, AMZN
1        JPM, BAC, GS
dtype: object

In [15]:
tickers.str.split(',')

0    [GOOG,  APPL,  AMZN]
1        [JPM,  BAC,  GS]
dtype: object

In [16]:
tickers.str.split(',').str[0]

0    GOOG
1     JPM
dtype: object

In [18]:
tickers.str.split(',', expand = True)

      0      1      2
0  GOOG   APPL   AMZN
1   JPM    BAC     GS

In [19]:
messy_names = pd.Series(['andrew  ', 'bo;bo', '   claire   '])

In [20]:
messy_names

0        andrew
1           bo;bo
2       claire
dtype: object

In [29]:
messy_names.str.replace(';', '').str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

In [25]:
messy_names.str.replace(';', '').str.strip()[0]

'andrew'

### DATE/TIME METHODS

In [3]:
from datetime import datetime

In [4]:
myyear = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [5]:
mydate = datetime(myyear, mymonth, myday, myhour, mymin, mysec)

In [6]:
mydate

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [7]:
mydate.year

2015

In [8]:
myser = pd.Series(['Nov 3, 1990', '2000-01-01'], None)

In [9]:
myser

0    Nov 3, 1990
1     2000-01-01
dtype: object

In [10]:
timeser = pd.to_datetime(myser)

In [11]:
timeser[0].year

1990

In [16]:
euro_date = '31-12-2000'

In [17]:
pd.to_datetime(euro_date, dayfirst = True)

Timestamp('2000-12-31 00:00:00')

In [18]:
style_date = '12--Dec--2000'

In [19]:
pd.to_datetime(style_date, format = '%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [20]:
custom_date = '12th of Dec 2000'

In [23]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

### INPUT & OUTPUT

In [24]:
df = pd.read_csv(r'D:\Datasets\titanic_data.csv')

In [25]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [27]:
df = df.drop('Pclass', axis = 1)

In [28]:
df

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [29]:
df.to_csv('titanic_cleaned.csv')